[["I HAVE SETTLED MY PAYMENT BUT I’M NOT SURE IF IT WAS ALREADY POSTED. NEVERTHELESS, HOW DO I FOLLOW-UP ON MY INSTALLATION?", "To check if payment has been posted (which is a necessary step prior to installation). please visit: https://gofiber.ph/application/check-status . Kindly key-in your reference number or registered email address. Posting of payments may vary depending on the payment channel. To learn more about payment channels, please visit: https://gofiber.ph/paybills#/paybills Please note that due to limited mobility brought about by lockdowns in various areas, we are having some difficulty installing as fast as we want to. We are doing our best to serve you at the soonest possible time.\nYou may help us by preparing all permits required to reach your house, if any (ex: brgy permits, gate passes, subdivision or bldg permits, etc.). Thank you for your patience."], ["WHAT INITIAL PAYMENTS DO I NEED TO SETTLE PRIOR TO INSTALLATION?", "To know more about your initial payment and for billing guide, please visit https://convergeict.com/ask-conrad-billing-tip-1/"], ["MY PAYMENT HAS ALREADY BEEN CREDITED, HOW DO I FOLLOW-UP ON MY INSTALLATION?", "Due to limited mobility brought about by lockdowns in various areas, we are having some difficulty installing as fast as we want to. We are doing our best to serve you at the soonest possible time. Please. help us by preparing all permits required to reach your house, if any (ex:brgy permits, gate passes, subdivision or bldg permits, etc.). Kindly send us your account number via: customercare@convergeict.com"], ["HOW DO I KNOW IF MY AREA IS SERVICEABLE BY CONVERGE ICT?", "To check your area’s serviceability, please visit https://gofiber.ph, click “Apply Now” and fill in the necessary information needed."], ["HOW DO I APPLY FOR A CONVERGE FIBER INTERNET PLAN?", "There are 4 ways to apply:\nVisit https://gofiber.ph/ and click apply now\nCall our Telesales Hotline 02 8667 0848 or thru Click2Call https://www.convergeict.com/contact-us/\nSend email to digisales@convergeict.com\nMessage our Facebook page https://www.facebook.com/ConvergeICTDigitalSales/"], ["HOW DO I CONVERT MY DOCSIS PLAN (AIR INTERNET) TO A FIBER PLAN (CONVERGE FIBER X)?", "We have to check the serviceability / coverage in your area. If your area is serviceable, please submit 1 valid ID of the account holder and Letter of Request to start the process. **If requestor is NOT the Account Holder, 1 Valid ID of the both parties is required (Account Holder and Requestor)\nPlease note that converting your docsis plan to fiber will reset your lock-in period to 24 months. For faster transactions, please ensure that all requirements are submitted (incomplete applications will not be processed).\nFREE CONVERSION – If your account is outside the lock-in period. However, if conversion request is within the lock-in period a P1,500 conversion fee will be charged (amortized for 3 months).\nTo start converting your docsis plan to a fiber plan, click here."], ["HOW DO I UPGRADE MY PLAN?", "You may visit our self-upgrade platform at https://upgrade-now.convergeict.com/."], ["DO YOU HAVE DEVICES THAT GO ALONG WITH YOUR FIBER INTERNET PLANS?", "Maximize your pure fiber experience with our value-added services. To know more, please visit: https://www.convergeict.com/add-on"], ["HOW DO I UPDATE INFORMATION IN MY ACCOUNT?", "To update your account details, please visit https://account-update.convergeict.com"], ["ARE YOUR PLANS AFFORDABLE?", "Converge takes pride in being able to offer the most affordable and the best value-for-money high speed fiber internet plans in the market.\nFor instance, our fiber for home product, Converge Fiber X starts at only P1500 with a whopping 25 mbps. Compared to other telco products, that is great value for your money!"], ["WHERE CAN I TAKE ADVANTAGE OF CONVERGE FIBER INTERNET?", "Converge made sure that you can enjoy premium fiber internet connectivity wherever you are. Be it at home (Converge Fiber X & Fiber Xtreme), in your small business (Converge FlexiBiz) or in your big corporations (Converge Enterprise)."], ["WHAT IS FIBER INTERNET TECHNOLOGY?", "Fiber Internet Technology is the most innovative connectivity in the market today.\nIt boasts of a higher bandwidth which translates to higher Internet speed.\nUnlike DSL, Fiber connection allows symmetric connectivity which lets you download and upload files at the same time without a loss in bandwidth.\nNo data congestion so data is delivered instantly.\nData  does not degrade when it passes through Fiber so you can enjoy consistently fast Internet speed.\nFiber uses lightweight, durable and non-flammable materials that are less susceptible to corrosion and environmental factors, so you can connect to the internet hassle-free with little to no downtime."], ["WHO IS CONVERGE ICT, INC?", "We are a premier provider of customer-focused telecommunications and ICT solutions dedicated to equip, enable and empower our clients. As a pioneer in Fiber optic installations, we have dedicated our experience and expertise to ensuring our customers receive the best in networking infrastructure, facilities management, broadband implementation and full telecommunication infrastructure and support."], ["WHY IS MY LINE DISCONNECTED?", "You may have overlooked your payments. For your convenience, please visit https://gofiber.ph/paybills#/paybills."], ["HOW DO I READ MY BILL?", "For billing guide, please visit https://www.convergeict.com/ask-conrad-billing-tip-1/"], ["WHERE DO I INQUIRE ABOUT DETAILS IN MY STATEMENT OF ACCOUNT?", "For your statement of account details, you may visit https://get-soa.convergeict.com"], ["HOW CAN MY SUBSCRIPTION BE RECONNECTED?", "For your account to be reconnected, please ensure that balance has been paid in full.\nReconnection will be automatic once payment has been posted in our system. To learn more about our payment channels, please visit:\nhttps://www.convergeict.com/how-do-i-pay-my-monthly-subscription"], ["HOW COME MY STATEMENT OF ACCOUNT IS NOT AVAILABLE IN GET-SOA.CONVERGEICT.COM?", "For us to assist you with this concern, please send us your account number via customercare@convergeict.com"], ["HOW DO I CHECK MY ACCOUNT BALANCE?", "You may check your account balance through: https://get-soa.convergeict.com"], ["HOW TO PAY MY BILL?", "You may use our online payment facility. For your convenience, please visit https://gofiber.ph/paybills#/paybills."], ["HOW DO I GET A COPY OF MY STATEMENT OF ACCOUNT?", "You may get a copy of your SOA via https://get-soa.converge.com"], ["DO YOU REALLY GIVE OUT SPECIAL PRIZES LIKE SOME POP-UP ADS AND SITES SAY?", "Your cybersecurity is important to us. Please be careful in accessing sites that may be fraudulent. To know more about our spam advisory, please visit: https://www.convergeict.com/watchoutforfraud"], ["HOW DO I CONTACT YOU FOR ANY CONCERNS?", "For any other concerns, you may reach us through the ff channels:\nTech support\nContact us\nConverge ICT Support"], ["HOW DO I GET MY REBATE FROM MEMBER-GET-MEMBER PROMO?", "Please ensure that you have followed the mechanics for the Member-Get Member Program to enjoy the rebate. Once approved, you will enjoy a 50% rebate from you referral’s plan. It will be deducted one time on your next billing statement cut-off.\nFor more details, you may visit: https://www.convergeict.com/promos/member-get-member/"], ["ARE YOUR BUSINESS CENTERS OPEN AT THIS TIME?", "Our business centers are open to serve you from 9am to 5pm, Mon. to Fri.\nStrict use of face mask and proper practice of social distancing measures will be applied inside and outside the office.\nThis is also to ensure the health and safety of both our subscribers and our employees. In compliance with the GCQ guidelines, Senior Citizens and Pregnant Women are highly discouraged from going to our business centers."], ["WHAT IS THE CONVERGE 1500 XTRA OR 10-FOR-99 OFFERING?", "Converge 1500 Xtra  (10-for-99) is a 10 Mbps for P99/ mo speed boost offering available for your Converge FiberX 35 Mbps plan.\nTo learn more, please visit: https://www.convergeict.com/1500-xtra/"], ["LAN – NO LIGHT", "If your LAN has no light:\nSwitch off your modem for 5 minutes then switch it back on.\nCheck both ends of the UTP cable if securely connected into the modem LAN port.\nIf this process does not work, please create a trouble ticket using our self-service facility by calling (02) 8667 0850 or (045) 598 3000, or by using our Click to Call facility"], ["POWER – NO LIGHT", "If your modem’s power button has no light:\nEnsure that the modem is switched on.\nCheck the condition of the wires.\nCheck if the adaptor is plugged in correctly\nIf this process does not work, please create a trouble ticket using our self-service facility by calling (02) 8667 0850 or (045) 598 3000, or by using our Click to Call facility."], ["PON – NO LIGHT OR BLINKING LIGHT", "If your PON has no light, please do the following steps:\nSwitch off your modem for 5 minutes then switch it back on.\nCheck the condition of the fiber patch cord for any break, bend or damage.\nEnsure that both ends of the fiber patch cord is inserted correctly.\nTry to detach and re-attach both ends of the fiber patch cord.\nIf this process does not work, please create a trouble ticket using our self-service facility by calling (02) 8667 0850 or (045) 598 3000, or by using our Click to Call facility."], ["SLOW OR INTERMITTENT CONNECTION", "If you are experiencing slow or intermittent connection, please note that your bandwidth is a resource shared by all devices connected to your modem. Try the following basic troubleshooting:\n Detach and attach the fiber patch cord on the modem.\nTurn off and on the Modem for 15 seconds.\nNote that the strength of the Wi-Fi signal deteriorates the farther you are from the modem. Physical obstructions also limit Wi-Fi connection integrity. For best results, find a spot clear of obstructions and limit the number of devices concurrently connected to the modem. Should you wish to experience very strong Wi-Fi connections, we recommend to:\nDisconnect the other devices including third part router if any.\nPlug a laptop or computer using a LAN cable directly to the modem to compare results.\nRun speed test at https://convergeict.speedtest.net/.\nIf this process does not work, please create a trouble ticket using our Tech Support Form or our self-service facility by calling (02) 8667 0850 or (045) 598 3000, or by using our Click to Call facility."], ["LOS – RED LIGHT OR BLINKING LIGHT", "Please create a ticket using our self-service facility by calling (02) 8667 0850 or (045) 598 3000, or by using our Click to Call facility. Follow the instructions on LOS RED indicator option."]]